Repository: faraham4/Artector
Catalog: Artector/Localizable.xcstrings
Source language: en
Languages: ar

source: In Still Life with Fish (1975), Radwi employs a combination of paint and sand. resulting in a flattened portrayal of two fish within a loosely arranged geometric framework. Still Life with Fish pays homage to the origins of the still life genre, as fish were frequently depicted in early still life compositions.
ar: في "لقطة ثابتة مع سمك" (1975)، يستخدم رضوي مزيجًا من الطلاء والرمل، مما ينتج عنه تصوير مسطح لسمكتين ضمن إطار هندسي مرتب بشكل فضفاض. "لقطة ثابتة مع سمك" تُكرم أصول فن الطبيعة الصامتة، حيث كان يتم تصوير السمك بشكل متكرر في تكوينات الطبيعة الصامتة الأولى.

source: More info
ar: معلومات أكثر

source: Abdulhalim Radwi
ar: عبد الحليم رضوي

source: Abduljabbar Alyahya
ar: عبد الجبار اليحيى

source: Abdullah Hammas
ar: عبد الله هماس

source: Abdullah Hammas is a prominent Saudi artist who is recognized as a pioneer of the fine art movement in Saudi Arabia. His works are celebrated for their symbolic abstraction, where he seeks to depict the real world in abstract symbols. Hammas's art often reflects the southern region of Saudi Arabia, specifically Asir, known for its rich natural beauty, customs, and colorful folk art. His paintings vividly portray the environment with bright and attractive colors, influenced by the local culture, traditions, and crafts.
ar: عبد الله حماس هو فنان سعودي بارز يعتبر رائدًا في حركة الفنون الجميلة في المملكة العربية السعودية. تشتهر أعماله بالتجريد الرمزي، حيث يسعى لتصوير العالم الواقعي في رموز مجردة. غالبًا ما تعكس فنون حماس المنطقة الجنوبية من السعودية، وبشكل خاص عسير، المعروفة بجمالها الطبيعي الغني، وعاداتها، وفنها الشعبي الملون. تصور لوحاته البيئة بألوان زاهية وجذابة، متأثرة بالثقافة المحلية والتقاليد والحرف اليدوية.

source: Abdulrahman Alsoliman
ar: عبد الحمن السليمان

source: Abdulrahman Alsoliman draws inspiration from the various urban and industrial landscapes of the Al-Ahsa region. His work navigates between different styles Including cubism, realism, abstraction, and surrealism. In the 1980s, Alsoliman explored historical, traditional, and societal shifts in Saudi Arabia.
ar: عبدالرحمن السليمان يستلهم إلهامه من المناظر الحضرية والصناعية المختلفة في منطقة الأحساء. يتنقل عمله بين أساليب مختلفة تشمل الكوبية، الواقعية، التجريدية، والسريالية. في الثمانينيات، استكشف السليمان التحولات التاريخية والتقليدية والاجتماعية في المملكة العربية السعودية.

source: Acrylic and oil on canvas. In Blind Light, Genadry transformed the flowing water of a waterfall, which reflects light much more than the surrounding mountains, into a radient beam of light that seams to slice through the rocks.
ar: أكريليك وزيت على قماش. في "ضوء أعمى"، حوّلت جنادري المياه المتدفقة لشلال، التي تعكس الضوء أكثر بكثير من الجبال المحيطة، إلى شعاع ضوء ساطع يبدو وكأنه يقطع الصخور.

source: Arif El Rayess
ar: عارف الريس

source: Artist Name
ar: اسم الفنان

source: Artist Story
ar: قصة الفنان

source: Artist Story:
ar: قصة الفنان:

source: Artist:
ar: الفنان

source: Artist: %@
ar: الفنان:

source: artistStory:
ar: قصة الفنان:

source: artistStory: %@
ar: قصة الفنان:

source: As a child, Zarina experienced the 1947 partition of the indian Subcontinent firsthand. like thousands of others, her family was displaced to a refugee camp to escape widespread violance. She felt a lifelong affinity with displaced peoples, often expressing solidarity through her printed work. In 2015, she was moved by the persecution of Rohingya Muslims in Myanmar and the hardships of their difficult passage into neighboring Bangladesh. She linked these with perilous journeys by boat to reach the borders of Europe, drowning thousands in the Mediterranean every year. This led to her body of work, Dark Sea, in reference to the darkness experienced by refugees crossing the sees at night on small boats to avoid being caught by border patrols.
ar: عاشت زارينا تجربة تقسيم شبه القارة الهندية عام 1947 بنفسها عندما كانت طفلة. مثل الآلاف غيرها، تم نزوح عائلتها إلى مخيم للاجئين للهروب من العنف الواسع الانتشار. شعرت بتعاطف مدى الحياة مع الشعوب المشردة، وغالبًا ما عبرت عن تضامنها من خلال أعمالها المطبوعة. في عام 2015، تأثرت بما تعرض له المسلمون الروهينجا في ميانمار من اضطهاد وبصعوبات رحلتهم الشاقة إلى بنغلاديش المجاورة. ربطت زارينا هذه الأحداث بالرحلات الخطيرة بالقوارب للوصول إلى حدود أوروبا، حيث يغرق الآلاف كل عام في البحر الأبيض المتوسط. أدى ذلك إلى خلق مجموعتها الفنية "البحر الداكن"، والتي تشير إلى الظلام الذي يختبره اللاجئون عند عبور البحار ليلاً على متن قوارب صغيرة لتجنب الإمساك بهم من قبل دوريات الحدود.

source: Blind Light, 2017
ar: الضوء الضرير ،٢٠١٧

source: Bullders, 1977
ar: البنّايه ،١٩٧٧

source: Camera View
ar: واجهة الكاميرا

source: Captured Image
ar: الصورة الملتقطة

source: Composition 1 and Composition 2, 1988
ar: التكوين ١ ، التكوين ٢ ، ١٩٨٨

source: Daniele Genadry
ar: دانيال جنادري

source: Dark Sea, 2016
ar: البحر الاسود، ٢٠١٦

source: Discover stories behind famous paintings
ar: اكتشف القصة خلف اللوحات الفنية المشهورة

source: Displayed Image
ar: الصورة المعروضة

source: Displayed image for painting result
ar: الصورة الخاصة بنتيجة اللوحة

source: Drawing inspiration from photographs, Daniele Genadry blends the photographic record, memory and histories of landscape painting into her work. Her paintings illustrate a highly individual and personal approach to painterly depictions of landscapes.
ar: مستلهمة الإلهام من الصور الفوتوغرافية، تمزج دانيال جنادري بين السجل الفوتوغرافي والذاكرة وتاريخ رسم المناظر الطبيعية في أعمالها. تظهر لوحاتها نهجاً شخصياً وفردياً عالياً في تصوير المناظر الطبيعية بطريقة تشكيلية.

source: El Rayess participated in the Jeddah embellishment intiated by then-mayor Mohammed Sayed Farsi, in collaboration with architect Julio Lafuente. The result of this years-long initiative is often referred to as an (open-air museum) and includes sculptures by invited Arab and international artists. El Rayess' 28-meter-high aluminuim sculpture Column of Light (1981), representing the word (Allah) (SWT), is still visible on a square on Palestine street in Jeddah. The artist's engagement with sculpture and architecture was influenced by his close relationship with architects Hassan Fathy and Fredrich Kiesler, and he produced numerous drawings, models and utopian architectural sketches. Captivated by the light of the Arabian desert, El Rayess a significant series of over 300 hundred landscapes, including paintings and drawings. In Tabuk, he photographed the rock formation of its mountains, villages and ancient ruins. All these elemnts feature in his landscapes as he seeks to capture the desert's changing light, vastness and spiritual dimensiom. El Rayess refers to these formal expiremnts as (Marhalat Al-Noor) or the (Period of Light), during which he undertook numerous studies and trials in capturing the light of the desert.
ar: شارك عارف الريس في مشروع تجميل جدة الذي بدأه العمدة آنذاك، محمد سعيد فارسي، بالتعاون مع المهندس المعماري جوليو لافوينتي. أسفر هذا المشروع الذي استمر لسنوات عن ما يُشار إليه غالبًا بـ "المتحف المفتوح" ويشمل تماثيل من قبل فنانين عرب ودوليين مدعوين. تمثال الريس الألمنيومي البالغ ارتفاعه 28 مترًا، "عمود النور" (1981)، الذي يمثل كلمة "الله" (سبحانه وتعالى)، لا يزال مرئيًا في ساحة على شارع فلسطين في جدة. تأثر ارتباط الفنان بالنحت والهندسة المعمارية بعلاقته الوثيقة مع المهندسين المعماريين حسن فتحي وفريدريك كيسلر، وقد أنتج العديد من الرسومات والنماذج والتصاميم المعمارية اليوتوبية. مفتونًا بضوء الصحراء العربية، أبدع الريس سلسلة مهمة تضم أكثر من 300 منظر طبيعي، بما في ذلك اللوحات والرسومات. في تبوك، صور تكوينات الصخور للجبال والقرى والأطلال القديمة. تظهر كل هذه العناصر في مناظره الطبيعية حيث يسعى لالتقاط تغير ضوء الصحراء وشساعتها وأبعادها الروحية. يشير الريس إلى هذه التجارب الشكلية بـ "مرحلة النور"، حيث قام بالعديد من الدراسات والتجارب في التقاط ضوء الصحراء.

source: Find out the story behind a famous painting with a tap!
ar: إكتشف القصة خلف أشهر اللوحات بنقره زر!

source: Fosa (The Pit), 2022
ar: المقبرة ٢٠٢٢

source: Fosa is part of series in which Iosu Aramburu revists photographs and engravings of 19th and 20th century archaeological explorations in Peru, where ambitous state-funded excavations were pivotal in crafting and shaping the recently independent country's national identity. Aramburu's paintings focus on images of conflict and confrontation between different times, where scientists, politicians, collectors and museum workers pose against artifacts and landscapes that represent the distant past. From the perspective of the landscape, archeaology shares many similarities with mining. The paintings highlight how the pursuit of archeaological knowledge can result in dispossession, appropriation and displacement.
ar: "المقبرة" هي جزء من سلسلة يعود فيها إيوسو أرامبورو إلى الصور الفوتوغرافية والنقوش للتنقيبات الأثرية في القرنين التاسع عشر والعشرين في بيرو، حيث كانت التنقيبات الطموحة الممولة من الدولة محورية في تشكيل وصياغة هوية البلاد الوطنية بعد الاستقلال مؤخرًا. تركز لوحات أرامبورو على صور الصراع والمواجهة بين أزمنة مختلفة، حيث يتخذ العلماء والسياسيون والجامعون وعمال المتاحف أوضاعًا مقابل القطع الأثرية والمناظر الطبيعية التي تمثل الماضي البعيد. من منظور المناظر الطبيعية، يشترك الأثر في العديد من الخصائص مع التعدين. تسلط اللوحات الضوء على كيفية أن السعي وراء المعرفة الأثرية يمكن أن يؤدي إلى الحرمان والاستيلاء والتهجير.

source: Get Started
ar: إبدأ

source: He was born in Mecca in 1939, and lived as an orphan of his father since the age of five, growing up in a poor family. He completed his general education in Mecca and assumed responsibility as the eldest sibling in his family since the age of nine, where he worked in selling balila (a Hejazi dish), guiding pilgrims, and meeting the needs of Hajj pilgrims. He graduated from Al-Aziziya School in 1960. His talent began to emerge early on and he expressed it at the Saudi Scientific Institute in 1958. Driven by the ambition to travel abroad and pursue higher studies, he went to Italy, specifically to the Academy of Fine Arts in Rome.
ar: ولد في مكة عام 1939م، وقد عاش يتيم الأب منذ سن الخامسة ونشأ في أسرة فقيرة. أكمل تعليمه العام في مكة المكرمة وتحمل المسئولية كأخ أكبر لأسرته منذ سن التاسعة، حيث عمل في بيع البليلة (أكلة حجازية) والطوافة وتلبية حاجات الحجاج. تخرج في المدرسة العزيزية في عام 1960. بدأت موهبته بالظهور في وقت مبكر وعبّر عنها في المعهد العلمي السعودي عام 1958. ألح عليه طموح السفر إلى الخارج واستكمال دراساته العليا في إيطاليا، تحديدًا في أكاديمية الفنون الجميلة في روما.

source: Identify
ar: تعرف

source: Identify Image
ar: تعرف على الصورة

source: Image for identification
ar: الصورة المراد التعرف عليها

source: Image Identification
ar: الصورة المراد التعرف عليها

source: Image Identification Result
ar: نتيجة التعرف

source: In composition 1 (1988), Hammas captures a glimpse of the old neighborhoods in dim morning light. The painting presents a harmonious interplay of various elements within the urban landscape each blending into another In composition 2( 1988), Hammas continues exploring old houses overlapping one. another depicting their different sizes and the simplicity of one predominant color the presence of blue behind the buildings in varying degrees of light symbolizes the overlap of light and darkness. This interplay between light and heat on the black
ar: في "التكوين 1" (1988)، يلتقط حماس لمحة من الأحياء القديمة في ضوء الصباح الخافت. تقدم اللوحة تفاعلًا متناغمًا لعناصر مختلفة داخل المشهد الحضري، حيث يندمج كل منها مع الآخر. في "التكوين 2" (1988)، يواصل حماس استكشاف المنازل القديمة المتداخلة، مصورًا أحجامها المختلفة وبساطة لون واحد سائد. ترمز وجود اللون الأزرق خلف المباني بدرجات مختلفة من الضوء إلى تداخل الضوء والظلام. هذا التفاعل بين الضوء والحرارة على الأسود...

source: In Thursday Market (1980), Alsabban offers insight into the bustling Thursday markets in Abha, where women engage in selling activities. Employing abstract geometric shapes, Alsabban interconnects architectural motifs, encapsulating the memory of the place. The human figures, positioned along the street, intertwine with the buildings, forming a harmonious visual narrative.
ar: في "سوق الخميس" (1980)، يقدم الصبان رؤية لأسواق الخميس المزدحمة في أبها، حيث تشارك النساء في أنشطة البيع. باستخدام الأشكال الهندسية المجردة، يربط الصبان بين الزخارف المعمارية، مُعَبّراً عن ذكرى المكان. الشخصيات البشرية، الموضوعة على طول الشارع، تتداخل مع المباني، مكونةً سردًا بصريًا متناغمًا.

source: In Untitled, the relationship between the Arab man and his heritage and his surroundings is depicted through his signature style of calculated portions of color. Th transperant figure, gazes over the Najd village, symbolizing his relationship with his legacy. Beneath him, there is a grounded curled-up female figure.
ar: في "بدون عنوان"، يُصوّر العلاقة بين الرجل العربي وتراثه ومحيطه من خلال أسلوبه المميز في استخدام نسب محسوبة من الألوان. الشخصية الشفافة، تحدق فوق قرية نجد، رمزاً لعلاقته بإرثه. أسفله، توجد شخصية أنثوية مجعدة على الأرض.

source: Indian handmade paper stained with Sumi ink mounted on Arches Cover buff paper. In the prints displayed here, Zarina superimposed strips of paper to recreate what can be interpreted as a passenger's perspective at sea at night. The curved shape repeated at the bottom of both images, evokes the stern of a boat. It is surrounded by darkness except for what appears to be lights on the horizon, a very distant glimmer of hope.
ar: ورق يدوي هندي ملطخ بحبر سومي مثبت على ورق آرشيز كوفر بلون الجاموس. في الطباعات المعروضة هنا، قامت زارينا بتراكب شرائح من الورق لإعادة إنشاء ما يمكن تفسيره على أنه منظور راكب في البحر ليلاً. تثير الشكل المنحني المتكرر في أسفل كلتا الصورتين، مؤخرة قارب. يحيط بها الظلام باستثناء ما يبدو أنه أضواء على الأفق، وميض بعيد جداً للأمل.

source: Iosu Aramburu
ar: إيوسو أرامبورو

source: Lebanese artist Arif El Rayess lived in Saudi Arabia from 1981 to 1989, during which he spent time in Jeddah, Riyadh, Tabuk and Al-Madinah Al-Munawwarah. An itinerant and prolific artist, he engaged with sculpture and architecture in a post-oil boom Saudi Arabia, where the kingdom's main cities were undergoing major beautification projects.
ar: الفنان اللبناني عارف الريس عاش في السعودية من عام 1981 إلى عام 1989، خلال هذه الفترة قضى وقتاً في جدة والرياض وتبوك والمدينة المنورة. كان عارف الريس فنانًا متنقلًا ومثمرًا، وقد انخرط في النحت والعمارة في السعودية بعد ازدهار النفط، حيث كانت المدن الرئيسية في المملكة تخضع لمشاريع تجميل كبرى.

source: Mona Lisa Painting Image
ar: صورة موناليزا

source: Mounirah Mosley
ar: منيرة موصلي

source: Mounirah Mosley explores unconventional mediums in her practice. She expiremnts with various materials such as handmade paper, natural dyes, copper, palm trees, wood and papyrus to create vibrant works that reflect Saudi traditions. Mosley connects her personal experiences and observations to broader social and political contexts.
ar: تستكشف مونيرة موسلي وسائط غير تقليدية في ممارستها الفنية. تجرب مواد متنوعة مثل الورق اليدوي، الأصباغ الطبيعية، النحاس، أشجار النخيل، الخشب والبردي لإنشاء أعمال فنية نابضة بالحياة تعكس التقاليد السعودية. تربط موسلي تجاربها الشخصية وملاحظاتها بالسياقات الاجتماعية والسياسية الأوسع.

source: Name:
ar: إسم اللوحة

source: Name: %@
ar: اسم اللوحة:

source: Navigate to painting info page
ar: انتقل الى صفحة معلومات اللوحة

source: No Image Available
ar: لا يوجد صورة

source: No image is available for the painting result
ar: لا يوجد معلومات متاحة

source: NO Value!!!!
ar: لا يوجد

source: Oil on canvas. his artwork presents a stylized desert landscape with a mixture of architecture and nature. In the foreground, there's a vibrant green strip of vegetation, possibly farmland. The middle ground features an assortment of buildings with simple, modernist shapes. Some resemble traditional dwellings, while others are more abstract, geometric forms. In the background, muted brown mountains rise under a pale sky, giving a sense of vast, open space. The color palette is subdued, with the exception of the greenery, which stands out against the earthy tones. The painting is set against a warm, orange backdrop that frames and accentuates the desert hues.
ar: زيت على قماش. تقدم هذه الأعمال الفنية منظراً صحراوياً مجرداً بمزيج من العمارة والطبيعة. في المقدمة، هناك شريط أخضر نابض بالحياة من النباتات، ربما يكون أرضاً زراعية. يعرض المنتصف تشكيلة متنوعة من المباني ذات أشكال بسيطة وحديثة. بعضها يشبه المساكن التقليدية، بينما البعض الآخر يأخذ أشكالاً أكثر تجريداً وهندسية. في الخلفية، ترتفع جبال بنية خافتة تحت سماء شاحبة، معطيةً إحساساً بالمساحة الواسعة والمفتوحة. لوحة الألوان خافتة، باستثناء الخضرة التي تبرز مقابل الألوان الأرضية. اللوحة موضوعة ضمن خلفية برتقالية دافئة تبرز وتحدد ألوان الصحراء.

source: Oil on canvas. In 'Our Generous Land' (1980), Almasari depicts the land, desert dunes, and mountains in an abstract way. Employing a color palette of reds and blues with geomatric shapes and sharp lines, he harmonises the convergence of spaces. The geomatric shapes also contribute to the optical illusion that he seeks to achieve.
ar: زيت على قماش. في "أرضنا الكريمة" (1980)، يصور المساري الأرض وكثبان الصحراء والجبال بطريقة مجردة. يستخدم لوحة ألوان من الأحمر والأزرق مع أشكال هندسية وخطوط حادة، ينسجم فيها تلاقي الفضاءات. تساهم الأشكال الهندسية أيضًا في الوهم البصري الذي يسعى لتحقيقه.

source: Oil on canvas. In Bullders (1977), two men are depicted wearing traditional attire as they carry construction materials. Alsoliman employs a Cubist style to transform the two builders into angular forms that intersect and overlap.
ar: زيت على قماش. في "فوسا"، يقف فريق من الأثريين فوق الأرض التي تحتفظ بالتاريخ الذي يهدفون إلى كشفه. تصور هذه اللوحة مجموعة من الشخصيات المجردة ذات الأسلوب الهندسي بملابس رسمية، واقفين على أرض جبلية ذات درجات لونية باردة. يضيف التباين بين ضوء الشمس الدافئ والأزرق والرمادي للمناظر الطبيعية عمقاً. الوجوه غير واضحة، مما يؤكد على موقف الشخصيات التأملي ضمن الفرشاة التعبيرية للمحيط. الجو العام تأملي وجاد.

source: Oil on canvas. In Fosa, a party of archaeologists stand above the ground that holds the history they aim to unearth. This painting depicts a group of abstract, geometrically-styled figures in formal attire, standing in a cool-hued, mountainous terrain. The contrast of warm sunlight against the blues and greys of the landscape adds depth. Faces are indistinct, emphasizing the figures' contemplative stance within the expressive brushwork of the surroundings. The overall mood is introspective and solemn.
ar: زيت على قماش. في "المقبرة"، يقف فريق من الأثريين فوق الأرض التي تحتفظ بالتاريخ الذي يهدفون إلى اكتشافه. تصور هذه اللوحة مجموعة من الشخصيات المجردة ذات الأسلوب الهندسي بملابس رسمية، واقفين على أرض جبلية ذات درجات لونية باردة. يضيف التباين بين ضوء الشمس الدافئ والأزرق والرمادي للمناظر الطبيعية عمقاً. الوجوه غير واضحة، مما يؤكد على موقف الشخصيات التأملي ضمن الفرشاة التعبيرية للمحيط. الجو العام تأملي وجاد.

source: Oil on canvas. The painting portrays an abstracted landscape with a dichotomy of nature and architecture. In the foreground, lush greenery suggests fertile land, while the background consists of soft brown mountains under a light sky. Between these two, various geometric and modernist structures in muted colors are scattered across a desert-like expanse, suggesting human habitation or industry amidst the vastness. The overall palette is dominated by earth tones with a splash of green, conveying a serene yet perhaps surreal scene.
ar: زيت على قماش. تصور اللوحة منظراً طبيعياً مجرداً مع ثنائية الطبيعة والعمارة. في المقدمة، يشير الخضرة الكثيفة إلى أرض خصبة، بينما يتكون الخلفية من جبال بنية ناعمة تحت سماء فاتحة. بين هذين، هناك هياكل هندسية وحديثة بألوان خافتة متناثرة عبر مساحة تشبه الصحراء، مما يوحي بالسكن البشري أو الصناعة وسط الفسحة الشاسعة. يسيطر على اللوحة الألوان الأرضية مع لمسة من الأخضر، مما ينقل مشهداً هادئاً وربما سريالياً.

source: Oil on canvas. Untitled (1988) presents a night of jubilation, as men stand holding the (teeran), a traditional Arabic percussion instrument. The men, dressed in local attire, become part of a vibrant tableau. The focal point lies at the center of the composition, with men and their drums arranged in a flowing formation, while the background fades Into a washed-out orange hue.
ar: زيت على قماش. اللوحة بدون عنوان (1988) تقدم ليلة من الابتهاج، حيث يقف الرجال ممسكين بـ (الطيران)، وهو آلة إيقاعية تقليدية عربية. الرجال، مرتدين الزي المحلي، يصبحون جزءًا من لوحة نابضة بالحياة. يقع نقطة التركيز في وسط التكوين، مع ترتيب الرجال وطبولهم في تشكيل منساب، بينما يتلاشى الخلفية إلى درجة برتقالية باهتة.

source: Oil on paper.The one on the left features a complex interplay of dark and neutral tones, with overlapping geometric shapes that create an almost architectural feel. The right painting contrasts with brighter blues and yellows, yet it also employs geometric abstraction to depict what could be an urban landscape. Both works play with form and space, creating depth and rhythm through the juxtaposition of shapes and colors.
ar: زيت على ورق. اللوحة على اليسار تتميز بتداخل معقد بين الألوان الداكنة والمحايدة، مع أشكال هندسية متداخلة تخلق شعوراً بالهندسة المعمارية. اللوحة على اليمين تتناقض بألوان أزرق وأصفر أكثر إشراقاً، ولكنها أيضاً تستخدم التجريد الهندسي لتصوير ما يمكن أن يكون منظراً حضرياً. تعمل كلتا اللوحتين مع الشكل والفضاء، خلقاً للعمق والإيقاع من خلال التجاور بين الأشكال والألوان.

source: Oil on wood ###
ar: زيت على خشب

source: Our Generous Land (The Spring of Generousity), 1980
ar: أرضنا العطاء نبع الكرم ،١٩٨٠

source: Painting Description
ar: وصف اللوحة

source: Painting Description:
ar: وصف اللوحة

source: Painting Name
ar: اسم اللوحة

source: Painting Story
ar: قصة اللوحة

source: Painting Story:
ar: قصة اللوحة

source: paintingDescription:
ar: وصف اللوحة:

source: paintingDescription: %@
ar: وصف اللوحة:

source: paintingStory:
ar: قصة اللوحه:

source: paintingStory: %@
ar: قصة اللوحه:

source: recognize
ar: ابحث

source: Result of the identification
ar: نتيجة التعرف

source: Saad Almasari
ar: سعد المسعري

source: Saad Almasari's works span various mediums and styles, including ceramics, bronze sculptures, oil paintings, watercolors and acrylics. He draws inspiration from memories, local heritage, architecture, socitey and the Saudi environment. The artist integerates the flatness of traditional islamic arts and infuses modernity by incorporating optical illusions.
ar: أعمال سعد المسعري تمتد عبر وسائط وأساليب متعددة، بما في ذلك الخزف، وتماثيل البرونز، واللوحات الزيتية، والألوان المائية والأكريليك. يستلهم إلهامه من الذكريات، والتراث المحلي، والعمارة، والمجتمع والبيئة السعودية. يدمج الفنان بين مسطحية الفنون الإسلامية التقليدية ويدخل الحداثة من خلال إدراج الوهم البصري.

source: Show Painting Info
ar: اظهر معلومات اللوحة

source: Show Result
ar: االنتيجة

source: Still Life with Fish, 1975
ar: صورة زيتية مع السمك ،١٩٧٥

source: Taha Alsabban
ar: طه الصبان

source: Tap to start image Identification
ar: انقر لبدء عملية التعرف على الصورة

source: The Land of Solidities (1970) may suggest a commentary on gender roles, or identity. It pays homage to the art historical tradition of including women in the landscape. Th e expressive color palette of the painting evokes the rich visual and cultural landscape of Saudi Arabia. This use of color creates a sense of tranquility of the natural surroundings. In the foreground, there is a figure resembling a woman fully covered with a black abaya, exuding mystery and anonymity. The presence of the necklace indicates personal expression despite the covered appearance.
ar: قد تشير لوحة "أرض الجمود" (1970) إلى تعليق على أدوار الجنسين أو الهوية. تقدم اللوحة تحية للتقليد التاريخي الفني الذي يتضمن تصوير النساء في المناظر الطبيعية. يثير الطيف اللوني التعبيري للوحة الغنى البصري والثقافي للمشهد السعودي. يخلق هذا الاستخدام للألوان إحساسًا بالهدوء في البيئة الطبيعية. في المقدمة، يوجد شكل يشبه امرأة مغطاة بالكامل بعباءة سوداء، تنضح بالغموض والتجهيل. تدل وجود القلادة على التعبير الشخصي بالرغم من المظهر المغطى.

source: The Land of Solidities, 1970
ar: أرض الجمود، ١٩٧٠
